SSierraAl/STM32N6_Discovery_Camera_ToF_SD/x-cube-n6-camera-capture-main/nucleo/x-cube-n6-camera-capture-main/Src/app_cam.c
   Uses g_frame_event_count (incremented by DCMIPP frame event ISR callback)
   to know EXACTLY when each frame DMA is complete. The pipe runs continuously
   through the entire batch, eliminating Stop/Restart tearing.
   ================================================================ */

int CAM_CallbackInit(uint8_t *buf, int buf_size, int width, int height, int fps)
{
  uint32_t t0 = HAL_GetTick();
#if PERF_DEBUG_LEVEL >= 1
  printf("[CAM] Callback-Batch init: full init + warmup + standby...\n");
#endif

  /* Reuse the proven standby init path. */
  int rc = CAM_InitAndStartContinuous(buf, buf_size, width, height, fps, SNAP_WARMUP_FRAMES);
  if (rc != 0) {
#if PERF_DEBUG_LEVEL >= 1
    printf("[CAM] Callback init FAILED rc=%d\n", rc);
#endif
    return -1;
  }

  /* Stop pipe and put sensor in standby (same as standby mode). */
  DCMIPP_HandleTypeDef *h = CMW_CAMERA_GetDCMIPPHandle();
  HAL_DCMIPP_CSI_PIPE_Stop(h, DCMIPP_PIPE1, DCMIPP_VIRTUAL_CHANNEL0);
  CAM_WriteSensorReg(IMX335_REG_MODE_SELECT, IMX335_MODE_STANDBY);

#if CAM_SENSOR_REG_DEBUG && (CAPTURE_MODE == 4)
  CAM_DumpImx335AeState("INIT_STANDBY");
#endif

  /* Reset frame event counter so captures start from a known state. */
  g_frame_event_count = 0;
  g_callback_ready = 1;

#if PERF_DEBUG_LEVEL >= 1
  printf("[CAM] Callback-Batch init done in %lu ms.\n", (unsigned long)(HAL_GetTick() - t0));
#endif
  return 0;
}

/**
 * @brief  Wake from standby, capture CALLBACK_FRAMES continuously, return to standby.
 *
 *   TRUE zero-copy, no-restart capture. The DCMIPP pipe is Started exactly
 *   ONCE for the whole batch and never stopped/restarted. Instead of
 *   memcpy-ing each frame out of a scratch buffer (which was measured to
 *   cost hundreds of ms per 2.4MB frame — PSRAM-to-PSRAM CPU copies are
 *   slow), we reprogram the DCMIPP's own ping-pong destination registers
 *   (HAL_DCMIPP_PIPE_SetMemoryAddress) 2 FRAMES AHEAD so the hardware DMAs
 *   each wanted frame DIRECTLY into its final batch_buf[] slot. No CPU
 *   copy, no race: an address is only ever reprogrammed right after the
 *   frame that was using it completes, and that same physical address
 *   isn't touched again for a full 2-frame period (~66 ms @30fps) — far
 *   longer than a register write takes.
 *
 *   Sequencing (k = frame index since Start, 0-based):
 *     k = 0 .. CALLBACK_WARMUP_FRAMES-1        -> warmup, discarded (lands in
 *                                                 capture_buf/save_buf scratch)
 *     k = CALLBACK_WARMUP_FRAMES .. (W+N-1)    -> the N=CALLBACK_FRAMES frames
 *                                                 we keep, DMA'd straight into
 *                                                 batch_buf[k-W]
 *   Two frames before each kept frame is due, we redirect whichever
 *   physical address is about to free up to point at that frame's final
 *   batch_buf slot — so by the time the hardware actually captures it, the
 *   destination is already correct.
 */
int CAM_CallbackBatchSnap(uint8_t *batch_buf, uint32_t frame_size)
{
#if PERF_CAMERA_FRAME_LOG
  uint32_t frame_times[CALLBACK_WARMUP_FRAMES + CALLBACK_FRAMES];
  uint32_t completed_frames = 0;
#endif
#if CAPTURE_MODE != 4
  (void)batch_buf; (void)frame_size; return -1;
#endif
  if (!batch_buf || !g_callback_ready) return -1;
#if CAPTURE_MODE == 4
  memset(g_callback_capture_ticks, 0, sizeof(g_callback_capture_ticks));
#endif

  extern uint8_t save_buf[]; /* unused in mode 4 otherwise — reused as scratch warmup buffer */
  uint8_t *const raw_buf[2] = { capture_buf, save_buf };

  PERF_MARK(g_perf_timer, CAM_INIT);
  uint32_t t0 = HAL_GetTick();
  uint8_t captured = 0;
  DCMIPP_HandleTypeDef *h = CMW_CAMERA_GetDCMIPPHandle();
  if (!h) return -1;

#if PERF_DEBUG_LEVEL >= 1
  printf("[CAM] Callback-Batch: wakeup + %d frames (zero-copy DMA, no restart)...\n", CALLBACK_FRAMES);
#endif

  /* ---------------------------------------------------------------
     Step 1: Wake sensor from standby.
     --------------------------------------------------------------- */
  CAM_WriteSensorReg(IMX335_REG_MODE_SELECT, IMX335_MODE_STREAMING);
  HAL_Delay(35);

  /* ---------------------------------------------------------------
     Step 2: Start continuous pipe ONCE with HARDWARE double buffering.
     Addresses start out pointing at scratch raw_buf[0]/raw_buf[1]; they
     get reprogrammed to batch_buf slots as the warmup tail approaches.
     --------------------------------------------------------------- */
  if (CMW_CAMERA_DoubleBufferStart(DCMIPP_PIPE1, raw_buf[0], raw_buf[1], CMW_MODE_CONTINUOUS) != CMW_ERROR_NONE) {
#if PERF_DEBUG_LEVEL >= 1
    printf("[CAM] Double-buffer start failed after callback wake\n");
#endif
    goto callback_exit;
  }

  /* ---------------------------------------------------------------
     Step 3: Re-apply exposure/gain after wake.
     --------------------------------------------------------------- */
  PERF_MARK(g_perf_timer, CAM_EXPO);
  CMW_CAMERA_SetExposureMode(CAM_EXPOSURE_MODE == 1 ? CMW_EXPOSUREMODE_MANUAL :
                             CAM_EXPOSURE_MODE == 2 ? CMW_EXPOSUREMODE_AUTOFREEZE : CMW_EXPOSUREMODE_AUTO);
  if (CAM_EXPOSURE_MODE == 1) {
    CMW_CAMERA_SetExposure(CAM_EXPOSURE_VALUE);
    CMW_CAMERA_SetGain(CAM_GAIN_VALUE);
    CAM_IspUpdate();
  }

  /* ---------------------------------------------------------------
     Step 4 + 5 unified: walk through warmup AND capture frames in one
     loop so the "arm 2 frames ahead" bookkeeping is simple/uniform.
     k in [0, CALLBACK_WARMUP_FRAMES) are discarded; k in
     [CALLBACK_WARMUP_FRAMES, CALLBACK_WARMUP_FRAMES+CALLBACK_FRAMES) are
     the frames we keep (out_idx = k - CALLBACK_WARMUP_FRAMES).
     --------------------------------------------------------------- */
  PERF_MARK(g_perf_timer, CAM_WARMUP);
#if PERF_DEBUG_LEVEL >= 1
  printf("[CAM] Callback warmup %d + capture %d frames...\n", CALLBACK_WARMUP_FRAMES, CALLBACK_FRAMES);
#endif
  {
    const uint32_t total = (uint32_t)CALLBACK_WARMUP_FRAMES + (uint32_t)CALLBACK_FRAMES;
    uint32_t frame_seq = 0;

