SSierraAl/STM32N6_Discovery_Camera_ToF_SD/x-cube-n6-camera-capture-main/nucleo/x-cube-n6-camera-capture-main/Src/app_cam.c
    for (uint32_t k = 0; k < total; k++) {
      uint32_t frame_ms = 0;

      if (k == CALLBACK_WARMUP_FRAMES) {
        PERF_MARK(g_perf_timer, CAM_SNAP);
      }

      if (CAM_WaitNextFrameReady(120, &frame_ms) != 0) {
#if PERF_DEBUG_LEVEL >= 1
        printf("[CAM] Frame wait timeout at k=%lu\n", (unsigned long)k);
#endif
        break;
      }
      frame_seq++;
#if PERF_CAMERA_FRAME_LOG
      frame_times[completed_frames++] = frame_ms;
#endif

      int32_t out_idx = (int32_t)k - (int32_t)CALLBACK_WARMUP_FRAMES;
      if (out_idx >= 0) {
        /* This frame was DMA'd directly into batch_buf[out_idx] — no copy
           needed, just drop any stale CPU cache lines before storage reads it. */
        uint8_t *dest = batch_buf + ((uint32_t)out_idx * frame_size);
        SCB_InvalidateDCache_by_Addr((uint32_t*)dest, frame_size);
        g_callback_capture_ticks[(uint32_t)out_idx] = HAL_GetTick();
        captured++;
      }

      /* Arm the address that JUST freed (used by the frame that just
         completed) for reuse 2 frames from now, if that future frame is
         one we want to keep. */
      int32_t arm_idx = out_idx + 2;
      if (arm_idx >= 0 && arm_idx < CALLBACK_FRAMES) {
        uint32_t parity = (frame_seq - 1U) % 2U;
        HAL_DCMIPP_PIPE_SetMemoryAddress(h, DCMIPP_PIPE1,
                                          parity == 0U ? DCMIPP_MEMORY_ADDRESS_0 : DCMIPP_MEMORY_ADDRESS_1,
                                          (uint32_t)(batch_buf + ((uint32_t)arm_idx * frame_size)));
      }
    }
  }

  /* ---------------------------------------------------------------
     Step 6: Stop pipe ONCE after ALL frames captured.
     --------------------------------------------------------------- */
callback_exit:
  /* Return to standby. */
  PERF_MARK(g_perf_timer, CAM_STOP);
  HAL_DCMIPP_CSI_PIPE_Stop(h, DCMIPP_PIPE1, DCMIPP_VIRTUAL_CHANNEL0);
  CAM_WriteSensorReg(IMX335_REG_MODE_SELECT, IMX335_MODE_STANDBY);
  PERF_MARK(g_perf_timer, CAM_DEINIT);
#if PERF_DEBUG_LEVEL >= 1
  uint32_t capture_elapsed_ms = HAL_GetTick() - t0;
#endif
#if PERF_CAMERA_FRAME_LOG
  /* UART output must not delay rearming or stopping the DMA pipe. */
  for (uint32_t k = 0; k < completed_frames; k++) {
    printf("[CAM] %s[%lu] wait=%lu ms\n",
           k < CALLBACK_WARMUP_FRAMES ? "warmup" : "capture",
           (unsigned long)(k < CALLBACK_WARMUP_FRAMES ? k : k - CALLBACK_WARMUP_FRAMES),
           (unsigned long)frame_times[k]);
  }
#endif
#if PERF_DEBUG_LEVEL >= 1
  printf("[CAM] Callback-Batch: %d/%d frames in %lu ms (continuous, zero-copy)\n",
         (unsigned)captured, CALLBACK_FRAMES, (unsigned long)capture_elapsed_ms);
#endif
#if CAM_SENSOR_REG_DEBUG && (CAPTURE_MODE == 4)
  if (captured > 0U) CAM_DumpImx335AeState("AFTER_BATCH_STANDBY");
#endif
  return (int)captured;
}

uint32_t CAM_GetCallbackFrameTick(uint32_t index)
{
#if CAPTURE_MODE == 4
  if (index < CALLBACK_FRAMES) return g_callback_capture_ticks[index];
#else
  (void)index;
#endif
  return 0U;
}

int CAM_IsCallbackReady(void)
{
  return g_callback_ready;
}
